;-*- mode: Org; fill-column: 110;-*-
*** test
#+NAME: initialization
#+BEGIN_SRC emacs-lisp
  (setq sentence "Never a foot too far, even.")
#+END_SRC

#+RESULTS: initialization
: Never a foot too far, even.


(org-babel-get-src-block-info) - src
: ("emacs-lisp" "  (setq sentence \"Never a foot too far, even.\")" ((:colname-names) (:rowname-names) (:result-params "replace") (:result-type . value) (:results . "replace") (:exports . "code") (:lexical . "no") (:tangle . "no") (:hlines . "no") (:noweb . "no") (:cache . "no") (:session . "none") ...) "" "initialization" 8809 "(ref:%s)")

(org-babel-expand-noweb-references (oai-block-get-info))


: (oai-block-get-info)
((:stream . "nil") (:max-tokens . 1200) (:sys . "Be helpful.") (:service . "github") (:model . "openai/gpt-4.1"))

(org-babel--expand-body (oai-block-get-info)
#+begin_ai :noweb yes :stream nil :max-tokens 1200 :sys "Be helpful."  :service github :model "openai/gpt-4.1"
<<initialization>>
#+end_ai
: -----------------------------------------------------------

#+begin_src elisp :noweb yes :lexical t :results none :exports code :eval yes
<<initialization>>
(org-babel-expand-noweb-references (list "markdown" "```lisp\n<<initialization>>\n```"))
#+end_src

(org-babel--expand-body (org-babel-get-src-block-info))
